In [2]:
%matplotlib inline
import pandas as pd

In [3]:
cast = pd.read_csv("/content/drive/My Drive/Colab Notebooks/cast.csv")
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [4]:
titles = pd.read_csv('/content/drive/My Drive/Colab Notebooks/titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [5]:
release_date = pd.read_csv("/content/drive/My Drive/Colab Notebooks/release_dates.csv")
release_date.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21

### How many movies are listed in the titles dataframe?

In [ ]:
n = titles.title.count()
print(n)

244914

### What are the earliest two films listed in the titles dataframe?

In [ ]:
titles.sort_values("year").head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [ ]:
len(titles[titles.title=="Hamlet"])

20

### How many movies are titled "North by Northwest"?

In [23]:
len(titles[titles.title=="North by Northwest"])

1

### When was the first movie titled "Hamlet" made?

In [ ]:
(titles[titles.title=="Hamlet"]).sort_values("year").head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [ ]:
titles[titles.title=="Treasure Island"].sort_values("year")

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [ ]:
len(titles[titles.year == 1950])

1113

### How many movies were made in the year 1960?

In [ ]:
len(titles[titles.year == 1960])

1549

### How many movies were made from 1950 through 1959?

In [ ]:
len(titles[(titles.year >= 1950) & (titles.year <= 1959)])

12934

### In what years has a movie titled "Batman" been released?

In [ ]:
titles.year[titles.title=="Batman"]

39349     1943
240896    1989
Name: year, dtype: int64

### How many roles were there in the movie "Inception"?

In [ ]:
len(cast[cast.title == "Inception"].character)

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [ ]:
s = cast[(cast.title == "Inception")]
s["n"].isna().sum()

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [ ]:
s = cast[(cast.title == "Inception")]
not_recieve = s["n"].isna().sum()
len(s) - not_recieve

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [48]:
nm = cast[cast.title=="North by Northwest"]
a = nm.dropna()
a.sort_values("n",axis = 0,ascending = True)

                      title  year  ...                    character     n
871426   North by Northwest  1959  ...           Roger O. Thornhill   1.0
3518333  North by Northwest  1959  ...                  Eve Kendall   2.0
1457165  North by Northwest  1959  ...              Phillip Vandamm   3.0
3157232  North by Northwest  1959  ...              Clara Thornhill   4.0
356707   North by Northwest  1959  ...                The Professor   5.0
3048272  North by Northwest  1959  ...                Mrs. Townsend   6.0
1695173  North by Northwest  1959  ...              Lester Townsend   7.0
1275337  North by Northwest  1959  ...                      Leonard   8.0
2447081  North by Northwest  1959  ...                     Valerian   9.0
1811387  North by Northwest  1959  ...              Victor Larrabee  10.0
665768   North by Northwest  1959  ...                        Licht  11.0
2295714  North by Northwest  1959  ...                   Auctioneer  12.0
464736   North by Northwest  1959  ...                    Dr. Cross  13.0
1508344  North by Northwest  1959  ...               Sergeant Flamm  14.0
206471   North by Northwest  1959  ...               Captain Junket  15.0
1384780  North by Northwest  1959  ...  Charley - Chicago Policeman  16.0

[16 rows x 6 columns]

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [ ]:
cast[(cast.title=="Sleuth") & (cast.year == 1972)].sort_values("n")

          title  year  ...                   character    n
1705394  Sleuth  1972  ...                 Andrew Wyke  1.0
326773   Sleuth  1972  ...                 Milo Tindle  2.0
373876   Sleuth  1972  ...           Inspector Doppler  3.0
1465483  Sleuth  1972  ...  Detective Sergeant Tarrant  4.0
2724553  Sleuth  1972  ...             Marguerite Wyke  5.0
1448690  Sleuth  1972  ...      Police Constable Higgs  6.0

[6 rows x 6 columns]

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [ ]:
cast[(cast.title=="Sleuth") & (cast.year == 2007)].sort_values("n")

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [ ]:
len(cast[(cast.title == "Hamlet") & (cast.year == 1921)].character)

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [6]:
len(cast[(cast.title == "Hamlet") & (cast.year == 1996)].character)

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [25]:
len(cast[(cast.character == "Hamlet")])

96

### How many people have played an "Ophelia"?

In [26]:
len(cast[(cast.character == "Ophelia")])

117

### How many people have played a role called "The Dude"?

In [9]:
len(cast[(cast.character == "The Dude")])

19

### How many people have played a role called "The Stranger"?

In [10]:
len(cast[(cast.character == "The Stranger")])

212

### How many roles has Sidney Poitier played throughout his career?

In [13]:
len(cast[(cast.name == "Sidney Poitier")])

43

### How many roles has Judi Dench played?

In [14]:
len(cast[(cast.name == "Judi Dench")])

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [31]:
cast[(cast.name == "Cary Grant") & ((cast.year >= 1940) & (cast.year<= 1949)) & (cast.n == 2)].sort_values("year")

                   title  year        name   type    character    n
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [32]:
cast[(cast.name == "Cary Grant") & ((cast.year >= 1940) & (cast.year<= 1949)) & (cast.n == 1)].sort_values("year")

                                       title  ...    n
871448               The Howards of Virginia  ...  1.0
871407                       His Girl Friday  ...  1.0
871450                The Philadelphia Story  ...  1.0
871438                             Suspicion  ...  1.0
871452                  The Talk of the Town  ...  1.0
871429                 Once Upon a Honeymoon  ...  1.0
871398                     Destination Tokyo  ...  1.0
871422                             Mr. Lucky  ...  1.0
871430                      Once Upon a Time  ...  1.0
871390                  Arsenic and Old Lace  ...  1.0
871425             None But the Lonely Heart  ...  1.0
871424                         Night and Day  ...  1.0
871427                             Notorious  ...  1.0
871444      The Bachelor and the Bobby-Soxer  ...  1.0
871445                     The Bishop's Wife  ...  1.0
871421  Mr. Blandings Builds His Dream House  ...  1.0
871402          Every Girl Should Be Married  ...  1.0
871411                I Was a Male War Bride  ...  1.0

[18 rows x 6 columns]

### How many roles were available for actors in the 1950s?

In [35]:
len(cast[((cast.year >= 1950) & (cast.year<= 1959)) & (cast.type == "actor")].character)

157738

### How many roles were available for actresses in the 1950s?

In [39]:
len(cast[((cast.year >= 1950) & (cast.year<= 1959)) & (cast.type == "actress")].character)

57733

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [43]:
len(cast[(cast.year == 1980) & (cast.n == 1)].character)

1183

### How many non-leading roles were available through from the beginning of film history through 1980?

In [44]:
len(cast[(cast.year == 1980) & (cast.n != 1)].character)

22289

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [47]:
b = cast[(cast.year == 1980)]
not_recieve = b["n"].isna().sum()
not_recieve

4466